MadueNice/libs/CANopenNode/CO_driver_STM32F4xx.c
		/*
		 * Configure global identifier, including RTR bit
		 *
		 * This is later used for RX operation match case
		 */
		buffer->ident = (ident & CANID_MASK) | (rtr ? FLAG_RTR : 0x00);
		buffer->mask = (mask & CANID_MASK) | FLAG_RTR;

		/* Set CAN hardware module filter and mask. */
		if (CANmodule->useCANrxFilters) {
			__NOP();
		}
	} else {
		ret = CO_ERROR_ILLEGAL_ARGUMENT;
	}

	return ret;
}

/******************************************************************************/
CO_CANtx_t*
CO_CANtxBufferInit(CO_CANmodule_t *CANmodule, uint16_t index, uint16_t ident,
		bool_t rtr, uint8_t noOfBytes, bool_t syncFlag) {
	CO_CANtx_t *buffer = NULL;

	if (CANmodule != NULL && index < CANmodule->txSize) {
		buffer = &CANmodule->txArray[index];

		/* CAN identifier, DLC and rtr, bit aligned with CAN module transmit buffer */
		buffer->ident = ((uint32_t) ident & CANID_MASK)
				| ((uint32_t) (rtr ? FLAG_RTR : 0x00));
		buffer->DLC = noOfBytes;
		buffer->bufferFull = false;
		buffer->syncFlag = syncFlag;
	}
	return buffer;
}

/**
 * \brief           Send CAN message to network
 * This function must be called with atomic access.
 *
 * \param[in]       CANmodule: CAN module instance
 * \param[in]       buffer: Pointer to buffer to transmit
 */
static uint8_t prv_send_can_message(CO_CANmodule_t *CANmodule,
		CO_CANtx_t *buffer) {
	static CAN_TxHeaderTypeDef tx_hdr;
	uint8_t success = 0;

	/* Check if TX FIFO is ready to accept more messages */
	if (HAL_CAN_GetTxMailboxesFreeLevel(CANModule_local->CANptr) > 0) {
		/*
		 * RTR flag is part of identifier value
		 * hence it needs to be properly decoded
		 */
		tx_hdr.ExtId = 0u;
		tx_hdr.IDE = CAN_ID_STD;
		tx_hdr.DLC = buffer->DLC;
		tx_hdr.StdId = buffer->ident & CANID_MASK;
		tx_hdr.RTR =
				(buffer->ident & FLAG_RTR) ? CAN_RTR_REMOTE : CAN_RTR_DATA;

		uint32_t TxMailboxNum; // Transmission MailBox number

		/* Now add message to FIFO. Should not fail */
		success = HAL_CAN_AddTxMessage(CANmodule->CANptr, &tx_hdr, buffer->data,
				&TxMailboxNum) == HAL_OK;
	}
	return success;
}

/******************************************************************************/
CO_ReturnError_t CO_CANsend(CO_CANmodule_t *CANmodule, CO_CANtx_t *buffer) {
	CO_ReturnError_t err = CO_ERROR_NO;

	/* Verify overflow */
	if (buffer->bufferFull) {
		if (!CANmodule->firstCANtxMessage) {
			/* don't set error, if bootup message is still on buffers */
			CANmodule->CANerrorStatus |= CO_CAN_ERRTX_OVERFLOW;
		}
		err = CO_ERROR_TX_OVERFLOW;
	}

	/*
	 * Send message to CAN network
	 *
	 * Lock interrupts for atomic operation
	 */
	CO_LOCK_CAN_SEND(CANmodule);
	if (prv_send_can_message(CANmodule, buffer)) {
		CANmodule->bufferInhibitFlag = buffer->syncFlag;
	} else {
		buffer->bufferFull = true;
		CANmodule->CANtxCount++;
	}
	CO_UNLOCK_CAN_SEND(CANmodule);

	return err;
}

/******************************************************************************/
void CO_CANclearPendingSyncPDOs(CO_CANmodule_t *CANmodule) {
	uint32_t tpdoDeleted = 0U;

	CO_LOCK_CAN_SEND(CANmodule);
	/* Abort message from CAN module, if there is synchronous TPDO.
	 * Take special care with this functionality. */
	if (/*messageIsOnCanBuffer && */CANmodule->bufferInhibitFlag) {
		/* clear TXREQ */
		CANmodule->bufferInhibitFlag = false;
		tpdoDeleted = 1U;
	}
	/* delete also pending synchronous TPDOs in TX buffers */
	if (CANmodule->CANtxCount > 0) {
		for (uint16_t i = CANmodule->txSize; i > 0U; --i) {
			if (CANmodule->txArray[i].bufferFull) {
				if (CANmodule->txArray[i].syncFlag) {
					CANmodule->txArray[i].bufferFull = false;
					CANmodule->CANtxCount--;
					tpdoDeleted = 2U;
				}
			}
		}
	}
	CO_UNLOCK_CAN_SEND(CANmodule);
	if (tpdoDeleted) {
		CANmodule->CANerrorStatus |= CO_CAN_ERRTX_PDO_LATE;
	}
}

/******************************************************************************/
/* Get error counters from the module. If necessary, function may use
 * different way to determine errors. */

void CO_CANmodule_process(CO_CANmodule_t *CANmodule) {
	uint32_t err = 0xFFFFFFFF;

	/* TODO: There might be some imporovement needed here */

	if (CANmodule->errOld != err) {
		uint16_t status = CANmodule->CANerrorStatus;

		uint32_t CO_HAL_CAN_ERROR = ((CAN_HandleTypeDef*) CANmodule->CANptr)->ErrorCode;

		CANmodule->errOld = CO_HAL_CAN_ERROR;

		if (CO_HAL_CAN_ERROR & HAL_CAN_ERROR_BOF) {
			/* bus off */
			status |= CO_CAN_ERRTX_BUS_OFF;
		} else {
			/* recalculate CANerrorStatus, first clear some flags */
			status &= 0xFFFF
					^ (CO_CAN_ERRTX_BUS_OFF | CO_CAN_ERRRX_WARNING
							| CO_CAN_ERRRX_PASSIVE | CO_CAN_ERRTX_WARNING
							| CO_CAN_ERRTX_PASSIVE);

			if (CO_HAL_CAN_ERROR & HAL_CAN_ERROR_EWG) { /* bus warning */
				status |= CO_CAN_ERRTX_WARNING | CO_CAN_ERRRX_WARNING;
			}

			//TODO : [HJ] Might need to check if it is the first message or not (Bootup message)
			if (CO_HAL_CAN_ERROR & HAL_CAN_ERROR_RX_FOV0) {
				status |= CO_CAN_ERRTX_PASSIVE | CO_CAN_ERRRX_PASSIVE;
			}

			if ((CO_HAL_CAN_ERROR & HAL_CAN_ERROR_RX_FOV0)
					|| (CO_HAL_CAN_ERROR & HAL_CAN_ERROR_RX_FOV1)) {
				status |= CO_CAN_ERRRX_OVERFLOW;
			}
		}
		CANmodule->CANerrorStatus = status;
	}
}




/**
 * \brief           Read message from RX FIFO
 * \param           hcan: pointer to an CAN_HandleTypeDef structure that contains
 *                      the configuration information for the specified CAN.
 * \param[in]       fifo: Fifo number to use for read
 * \param[in]       fifo_isrs: List of interrupts for respected FIFO
 */
static void prv_read_can_received_msg(CAN_HandleTypeDef *hcan,
		uint32_t fifo, uint32_t fifo_isrs) {
	static CAN_RxHeaderTypeDef rx_hdr;
	CO_CANrxMsg_t rcvMsg;
	CO_CANrx_t *buffer = NULL; /* receive message buffer from CO_CANmodule_t object. */
	uint16_t index; /* index of received message */
	uint32_t rcvMsgIdent; /* identifier of the received message */
	uint8_t messageFound = 0;

	/* Read received message from FIFO */
	if (HAL_CAN_GetRxMessage(hcan, fifo, &rx_hdr, rcvMsg.data) != HAL_OK) {
		return;
	}


